def LR_model(Xtrain, ytrain, Xtest):
    # 1.函数功能说明
    # 应用线性回归算法对train_series训练建模，输出数据集X_test上的模型预测结果，一个序列
    
    # 2.参数说明 
    '''
	:param Xtrain: 训练特征数据集
	:param ytrain: 训练标签数据集
	:param Xtest: 测试特征数据集
    :return: 返回与Xtrain对应的预测值序列
    '''
    
    # 3.函数内部导包
    from sklearn.linear_model import LinearRegression
    
    # 4.处理过程
    LR = LinearRegression().fit(Xtrain, ytrain)
    print(LR.score(Xtrain, ytrain))
    yhat = LR.predict(Xtest)
    
    # 5.函数结果
    return yhat
    
########## 测试 #########    
# Xtrain
    '''
                福建用电量	年末常住人口	能源消费总量	第二产业生产总值占比
    2001-12-31	0.093822	0.010264	0.074930	0.023095
    2002-12-31	0.131272	0.008999	0.142974	0.029345
    2003-12-31	0.178935	0.007480	0.123701	0.030702
    2004-12-31	0.134220	0.007710	0.114522	0.023404
    '''
    # ytrain
    '''
    2001-12-31    0.086583
    2002-12-31    0.101607
    2003-12-31    0.114623
    2004-12-31    0.118324
    Freq: A-DEC, Name: 福建GDP, dtype: float64
    '''
    # X_test
    '''
            	福建用电量	年末常住人口	能源消费总量	第二产业生产总值占比
    2005-12-31	0.138820	0.007934	0.270814	0.008316
    2006-12-31	0.145733	0.007872	0.111724	0.004124
    2007-12-31	0.153995	0.007531	0.111369	-0.006160
    '''
    
    # result = LR_model(Xtrain, ytrain, X_test)
    # result：
    '''
    2005-12-31    0.115999
    2006-12-31    0.147997
    2007-12-31    0.152001
    '''
